In [1]:
import numpy as pd
import pandas as pd

In [2]:
df = pd.read_csv('data/admission_master.csv', low_memory=False)
df.head()

,ID,Accept,HSCity,HST,College,MAJOR_CODE,Major Description,1ST GEN,RGPA,Rating,...,ADMT_DESC,COMP,APP_ENTRY_TERM,DEGREE_TYPE,RESIDENT_CODE,ENROLL,JESUIT,HSNATION,RELIGION,APPLIED
0,214717,NaN,North Eastham,MA,Dolan School of Business,Business Undeclared,Business Undeclared,34,2.15,9.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,214861,NaN,Bridgeport,CT,Dolan School of Business,Marketing,Marketing,34,2.52,9.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,211022,NaN,Newark,NJ,Dolan School of Business,Marketing,Marketing,N,1.24,9.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,211015,NaN,New York,NY,College of Arts and Sciences,Undeclared,Undeclared,N,1.90,9.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,204374,NaN,Danbury,CT,Dolan School of Business,Management,Management,34,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
df.columns

Index(['ID', 'Accept', 'HSCity', 'HST', 'College', 'MAJOR_CODE',
       'Major Description', '1ST GEN', 'RGPA', 'Rating', 'P_M', 'Merit', 'DEC',
       'APP_DESC', 'ACCP', 'CONF', 'Citizen', 'Sex', 'RES', 'Class Rank',
       'Class Size', 'Class Percentile', 'Active City', 'Active Region',
       'Active Postal', 'Active Country', 'Ethnicity', 'Test Optional',
       'Legacy', 'SAT Math OLD', 'SAT WRI OLD', 'SAT Verbal OLD',
       'Total SAT OLD', 'ACT', 'SAT Reading USE', 'SAT Math USE',
       'SAT Total USE', 'Enroll', 'College Code', 'Sum Ver & Wri',
       'SAT Critical Reading - conversion', 'SAT Math - conversion',
       'SAT Reading NEW', 'SAT Math NEW', 'SAT Total NEW', 'Ethnicity Code',
       'ADMIT_TYPE', 'ADMT_DESC', 'COMP', 'APP_ENTRY_TERM', 'DEGREE_TYPE',
       'RESIDENT_CODE', 'ENROLL', 'JESUIT', 'HSNATION', 'RELIGION', 'APPLIED'],
      dtype='object')

In [4]:
df = df.drop(['Accept','Enroll','ENROLL','SAT Critical Reading - conversion',
             'SAT Math - conversion','SAT Reading NEW', 'SAT Math NEW', 'SAT Total NEW', 'Ethnicity Code',
       'ADMIT_TYPE', 'ADMT_DESC', 'COMP', 'APP_ENTRY_TERM','SAT Math OLD', 'SAT WRI OLD', 'SAT Verbal OLD',
       'Total SAT OLD','HSNATION','Sum Ver & Wri', 'APPLIED','College Code'], axis=1)

In [5]:
df.columns

Index(['ID', 'HSCity', 'HST', 'College', 'MAJOR_CODE', 'Major Description',
       '1ST GEN', 'RGPA', 'Rating', 'P_M', 'Merit', 'DEC', 'APP_DESC', 'ACCP',
       'CONF', 'Citizen', 'Sex', 'RES', 'Class Rank', 'Class Size',
       'Class Percentile', 'Active City', 'Active Region', 'Active Postal',
       'Active Country', 'Ethnicity', 'Test Optional', 'Legacy', 'ACT',
       'SAT Reading USE', 'SAT Math USE', 'SAT Total USE', 'DEGREE_TYPE',
       'RESIDENT_CODE', 'JESUIT', 'RELIGION'],
      dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54379 entries, 0 to 54378
Data columns (total 36 columns):
ID                   54379 non-null int64
HSCity               54217 non-null object
HST                  52927 non-null object
College              54377 non-null object
MAJOR_CODE           54378 non-null object
Major Description    33566 non-null object
1ST GEN              46296 non-null object
RGPA                 41233 non-null float64
Rating               42016 non-null float64
P_M                  22975 non-null object
Merit                26423 non-null object
DEC                  51989 non-null object
APP_DESC             51989 non-null object
ACCP                 34505 non-null object
CONF                 5174 non-null object
Citizen              54374 non-null object
Sex                  54379 non-null object
RES                  44400 non-null object
Class Rank           7530 non-null float64
Class Size           7529 non-null float64
Class Percentile     6904 non-null float64
Active City          44393 non-null object
Active Region        53545 non-null object
Active Postal        44068 non-null object
Active Country       44393 non-null object
Ethnicity            54118 non-null object
Test Optional        54379 non-null object
Legacy               9018 non-null object
ACT                  12899 non-null float64
SAT Reading USE      23438 non-null float64
SAT Math USE         23437 non-null float64
SAT Total USE        23437 non-null float64
DEGREE_TYPE          9977 non-null object
RESIDENT_CODE        9978 non-null object
JESUIT               512 non-null object
RELIGION             9166 non-null object
dtypes: float64(9), int64(1), object(26)
memory usage: 14.9+ MB

In [7]:
dfy = df.filter(['ACCP','CONF'])
dfy.to_csv('data/targets.csv', index=0)

In [8]:
df = df.drop(['ACCP','CONF','APP_DESC','DEC'], axis=1)
df.columns

Index(['ID', 'HSCity', 'HST', 'College', 'MAJOR_CODE', 'Major Description',
       '1ST GEN', 'RGPA', 'Rating', 'P_M', 'Merit', 'Citizen', 'Sex', 'RES',
       'Class Rank', 'Class Size', 'Class Percentile', 'Active City',
       'Active Region', 'Active Postal', 'Active Country', 'Ethnicity',
       'Test Optional', 'Legacy', 'ACT', 'SAT Reading USE', 'SAT Math USE',
       'SAT Total USE', 'DEGREE_TYPE', 'RESIDENT_CODE', 'JESUIT', 'RELIGION'],
      dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54379 entries, 0 to 54378
Data columns (total 32 columns):
ID                   54379 non-null int64
HSCity               54217 non-null object
HST                  52927 non-null object
College              54377 non-null object
MAJOR_CODE           54378 non-null object
Major Description    33566 non-null object
1ST GEN              46296 non-null object
RGPA                 41233 non-null float64
Rating               42016 non-null float64
P_M                  22975 non-null object
Merit                26423 non-null object
Citizen              54374 non-null object
Sex                  54379 non-null object
RES                  44400 non-null object
Class Rank           7530 non-null float64
Class Size           7529 non-null float64
Class Percentile     6904 non-null float64
Active City          44393 non-null object
Active Region        53545 non-null object
Active Postal        44068 non-null object
Active Country       44393 non-null object
Ethnicity            54118 non-null object
Test Optional        54379 non-null object
Legacy               9018 non-null object
ACT                  12899 non-null float64
SAT Reading USE      23438 non-null float64
SAT Math USE         23437 non-null float64
SAT Total USE        23437 non-null float64
DEGREE_TYPE          9977 non-null object
RESIDENT_CODE        9978 non-null object
JESUIT               512 non-null object
RELIGION             9166 non-null object
dtypes: float64(9), int64(1), object(22)
memory usage: 13.3+ MB

In [10]:
names = []
val = []

for col in df.columns:
    names.append(col)
    val.append(df[df.columns].isnull().sum())
    break
    #### print out results as (column_name, # of null values in column_name)
print(names, val)

['ID'] [ID                       0
HSCity                 162
HST                   1452
College                  2
MAJOR_CODE               1
Major Description    20813
1ST GEN               8083
RGPA                 13146
Rating               12363
P_M                  31404
Merit                27956
Citizen                  5
Sex                      0
RES                   9979
Class Rank           46849
Class Size           46850
Class Percentile     47475
Active City           9986
Active Region          834
Active Postal        10311
Active Country        9986
Ethnicity              261
Test Optional            0
Legacy               45361
ACT                  41480
SAT Reading USE      30941
SAT Math USE         30942
SAT Total USE        30942
DEGREE_TYPE          44402
RESIDENT_CODE        44401
JESUIT               53867
RELIGION             45213
dtype: int64]

## Binning

In [11]:
# function for assigning college bins
def assign_college_bins(College):
    if College == 'Dolan School of Business': 
        return(1)
    if College == 'College of Arts & Sciences' or College == 'College of Arts and Sciences':
        return(2)
    if College == 'School of Engineering':
        return(3)    
    if College == 'Egan School of Nursing & Health Sciences' or College == 'Egan School of Nursing and Health Studies':
        return(4)
    else:
        return(5)

# Applying College_Bins function to the DataFrame
df['College_Bins'] = df['College'].apply(assign_college_bins)
df.head()

,ID,HSCity,HST,College,MAJOR_CODE,Major Description,1ST GEN,RGPA,Rating,P_M,...,Legacy,ACT,SAT Reading USE,SAT Math USE,SAT Total USE,DEGREE_TYPE,RESIDENT_CODE,JESUIT,RELIGION,College_Bins
0,214717,North Eastham,MA,Dolan School of Business,Business Undeclared,Business Undeclared,34,2.15,9.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1
1,214861,Bridgeport,CT,Dolan School of Business,Marketing,Marketing,34,2.52,9.0,NaN,...,NaN,NaN,440.0,450.0,890.0,NaN,NaN,NaN,NaN,1
2,211022,Newark,NJ,Dolan School of Business,Marketing,Marketing,N,1.24,9.0,NaN,...,NaN,18.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1
3,211015,New York,NY,College of Arts and Sciences,Undeclared,Undeclared,N,1.90,9.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2
4,204374,Danbury,CT,Dolan School of Business,Management,Management,34,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1

In [13]:
def assign_legacy_bins(Legacy):
    if Legacy == 'A' or Legacy=='B' or Legacy=='C' or Legacy=='G' or Legacy=='N' or Legacy=='Brother/Sister Current Student' or Legacy=='Brother/Sister of Alumni' or Legacy=='Child/Grandchild of Alumni': 
        return(1)
    else:
        return(2)

# Applying legacy_bins function to the DataFrame
df['Legacy_Bins'] = df['Legacy'].apply(assign_legacy_bins)
df.head()

,ID,HSCity,HST,College,MAJOR_CODE,Major Description,1ST GEN,RGPA,Rating,P_M,...,ACT,SAT Reading USE,SAT Math USE,SAT Total USE,DEGREE_TYPE,RESIDENT_CODE,JESUIT,RELIGION,College_Bins,Legacy_Bins
0,214717,North Eastham,MA,Dolan School of Business,Business Undeclared,Business Undeclared,34,2.15,9.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,2
1,214861,Bridgeport,CT,Dolan School of Business,Marketing,Marketing,34,2.52,9.0,NaN,...,NaN,440.0,450.0,890.0,NaN,NaN,NaN,NaN,1,2
2,211022,Newark,NJ,Dolan School of Business,Marketing,Marketing,N,1.24,9.0,NaN,...,18.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,2
3,211015,New York,NY,College of Arts and Sciences,Undeclared,Undeclared,N,1.90,9.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2,2
4,204374,Danbury,CT,Dolan School of Business,Management,Management,34,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,2